Merge pull request #1 from wridgeu/feat/leave-guards
feat: add leave guards
